---
kind: method
id: M:Autodesk.Revit.DB.ShapeBuilder.Dispose
source: html/efbfadf8-519d-7f66-8553-e887ed3058f1.htm
---
# Autodesk.Revit.DB.ShapeBuilder.Dispose Method

Releases all resources used by the ShapeBuilder

## Syntax (C#)
```csharp
public void Dispose()
```